Revit 2026 API

# ShapeImporter Methods

---

The ShapeImporter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Convert | Converts the geometry stored in the external format into a collection of Revit geometry objects. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsServiceAvailable | Checks whether the data conversion service and Material Library are available. |
|  | SetDefaultLengthUnit | Sets the length unit to be used when the input is a unitless SAT file. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ShapeImporter Class

Autodesk.Revit.DB Namespace